{
    "language-name": "testing",
    "toolbar": {
        "run": "Run all code (ctrl+shift+enter)",
        "upload": "upload to gallery",
        "clear": "clear all",
        "shuffle": "show random sketch",
        "random": "make random change",
        "show-info": "show info window",
        "hide-info": "hide info window"
    },
    "info": {
        "title": "hsldfkmydra",
        "subtitle": "live coding networked visuals",
        "description": "Hydra is a platform for live coding visuals, in which each connected browser window can be used as a node of a modular and distributed video synthesizer.",
        "get-started-title": "To get started:",
        "get-started-list": [
            "Close this window",
            "Change some numbers",
            "Type Ctrl + Shift + Enter"
        ],
        "description-detailed": "Built using WebRTC (peer-to-peer web streaming) and WebGL, hydra allows each connected browser/device/person to output a video signal or stream, and receive and modify streams from other browsers/devices/people. The API is inspired by analog modular synthesis, in which multiple visual sources (oscillators, cameras, application windows, other connected windows) can be transformed, modulated, and composited via combining sequences of functions.",
        "features": "Features:",
        "features-list": [
            "Written in javascript and compatible with other javascript libraries",
            "Available as a platform as well as a set of standalone modules",
            "Cross-platform and requires no installation (runs in the browser)",
            "Also available as a package for live coding from within atom text editor",
            "Experimental and forever evolving !!"
        ],
        "author": "Created by <a {{author}}>olivia.</a>",
        "more-info": "For more information and instructions, see: <a {{docs}}>the online documentation</a>, <a {{functions}}>a list of hydra functions</a>, <a {{repo}}>the source code on github</a>, <a {{gallery}}>a gallery of user-generated sketches</a>, <a {{pixeljam}}>PIXELJAM collaborative editor</a>, <a {{hydra-book}}>Hydra Book</a>, and more <a {{tutorials}}>tutorials and examples.</a>",
        "more-info-forums": "There is also an active <a {{discord}}>Discord server</a> and <a {{facebook}}>facebook group</a> for hydra users+contributors.",
        "support": "If you enjoy using Hydra, please consider  <a {{open-collective}} >supporting continued development <3 </a>."
    }
}